  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/add-firewall` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/375a2898-dbb3-4271-9a10-1c6b60a1ed1a/terraform-bin plan -no-color -compact-warnings

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

# module.eastus2-vms[0].azurerm_network_interface.nic has been deleted
- resource "azurerm_network_interface" "nic" {
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic" -> null
      name                          = "eastus2-vm-0-nic"
      # (9 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# module.eastus2-vms[0].azurerm_network_security_group.nsg has been deleted
- resource "azurerm_network_security_group" "nsg" {
    - id                  = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/eastus2-vm-0-nsg" -> null
      name                = "eastus2-vm-0-nsg"
      # (3 unchanged attributes hidden)
  }

# module.eastus2-vms[0].azurerm_public_ip.public_ip[0] has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/eastus2-vm-0-public-ip" -> null
      name                    = "eastus2-vm-0-public-ip"
      # (9 unchanged attributes hidden)
  }

# module.westus2-vms[0].azurerm_network_interface.nic has been deleted
- resource "azurerm_network_interface" "nic" {
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic" -> null
      name                          = "westus2-vm-0-nic"
      # (9 unchanged attributes hidden)

      # (1 unchanged block hidden)
  }

# module.westus2-vms[0].azurerm_network_security_group.nsg has been deleted
- resource "azurerm_network_security_group" "nsg" {
    - id                  = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/westus2-vm-0-nsg" -> null
      name                = "westus2-vm-0-nsg"
      # (3 unchanged attributes hidden)
  }

# module.westus2-vms[0].azurerm_public_ip.public_ip[0] has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/westus2-vm-0-public-ip" -> null
      name                    = "westus2-vm-0-public-ip"
      # (9 unchanged attributes hidden)
  }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

# module.eastus2-firewall.azurerm_firewall_policy.policy will be updated in-place
~ resource "azurerm_firewall_policy" "policy" {
      id                       = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/firewallPolicies/eastus2-firewall-policy"
      name                     = "eastus2-firewall-policy"
      tags                     = {}
      # (8 unchanged attributes hidden)

    + insights {
        + default_log_analytics_workspace_id = (known after apply)
        + enabled                            = true
        + retention_in_days                  = 30
      }
  }

# module.eastus2-firewall.azurerm_log_analytics_workspace.firewall_log_workspace will be created
+ resource "azurerm_log_analytics_workspace" "firewall_log_workspace" {
    + daily_quota_gb                     = -1
    + id                                 = (known after apply)
    + internet_ingestion_enabled         = true
    + internet_query_enabled             = true
    + location                           = "eastus2"
    + name                               = "eastus2-firewall-log-workspace"
    + primary_shared_key                 = (sensitive value)
    + reservation_capacity_in_gb_per_day = (known after apply)
    + resource_group_name                = "org-jcetina-repo-baklava-rg"
    + retention_in_days                  = 30
    + secondary_shared_key               = (sensitive value)
    + sku                                = "PerGB2018"
    + workspace_id                       = (known after apply)
  }

# module.eastus2-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus2"
    + max_bid_price                   = -1
    + name                            = "eastus2-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXfeNESzeBpNFl0W8801NXA+539N6Q06VPKFV63alXC77aoNgNBNU16jDajStBz7zA6brxhwhwTR9V4zQwLJxLkmq2oO8mm1zqy1AgeWC2/zwvp7PJ1Md7vNbmERInJ6FN8C6Xa7jf3NbFQfnaodnb9j+zuFKN4HGi0+Su/EUzvMAqeMS1RjFTxQGhpG0zRdHL9sqnKKR2c9S3/XSWNFej3XFueuMhUnGqyv84vVZYx6SpH383wFIa7Y1p+Skkf3o9WQsQ6pdGvcTIDx6V4+vo5lKUmMOHLiJNx3fGjoDHIDbnhT1GH2Hb8IjFkUKfRqCLr1zKxiWoMxmb/Ipx0FnF jcetina@Jasons-MBP
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.eastus2-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus2"
    + mac_address                   = (known after apply)
    + name                          = "eastus2-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/VmSubnet"
      }
  }

# module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_association" {
    + id                        = (known after apply)
    + network_interface_id      = (known after apply)
    + network_security_group_id = (known after apply)
  }

# module.eastus2-vms[0].azurerm_network_security_group.nsg will be created
+ resource "azurerm_network_security_group" "nsg" {
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "eastus2-vm-0-nsg"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + security_rule       = [
        + {
            + access                                     = "Allow"
            + description                                = ""
            + destination_address_prefix                 = "*"
            + destination_address_prefixes               = []
            + destination_application_security_group_ids = []
            + destination_port_range                     = "22"
            + destination_port_ranges                    = []
            + direction                                  = "Inbound"
            + name                                       = "SSH"
            + priority                                   = 1001
            + protocol                                   = "Tcp"
            + source_address_prefix                      = "*"
            + source_address_prefixes                    = []
            + source_application_security_group_ids      = []
            + source_port_range                          = "*"
            + source_port_ranges                         = []
          },
      ]
  }

# module.eastus2-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "eastus2-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.eastus2-vms[0].random_id.random_id will be destroyed
# (because random_id.random_id is not in configuration)
- resource "random_id" "random_id" {
    - b64_std     = "XQQSqCClTrU=" -> null
    - b64_url     = "XQQSqCClTrU" -> null
    - byte_length = 8 -> null
    - dec         = "6702502658745650869" -> null
    - hex         = "5d0412a820a54eb5" -> null
    - id          = "XQQSqCClTrU" -> null
    - keepers     = {
        - "resource_group" = "org-jcetina-repo-baklava-rg"
      } -> null
  }

# module.sites["eastus2"].azurerm_route_table.for_every_subnet_but_vnet_gw must be replaced
-/+ resource "azurerm_route_table" "for_every_subnet_but_vnet_gw" {
    ~ id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/for-every-subnet-but-vnet-gw" -> (known after apply)
    ~ location                      = "westus2" -> "eastus2" # forces replacement
      name                          = "for-every-subnet-but-vnet-gw"
    ~ route                         = [
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "local-vnet-no-firewall"
            + next_hop_in_ip_address = ""
            + next_hop_type          = "VnetLocal"
          },
        - {
            - address_prefix         = "10.1.0.0/16"
            - name                   = "local-vnet-no-firewall"
            - next_hop_in_ip_address = ""
            - next_hop_type          = "VnetLocal"
          },
          # (3 unchanged elements hidden)
      ]
    ~ subnets                       = [] -> (known after apply)
    - tags                          = {} -> null
      # (2 unchanged attributes hidden)
  }

# module.sites["eastus2"].azurerm_route_table.for_vnet_gw must be replaced
-/+ resource "azurerm_route_table" "for_vnet_gw" {
    ~ id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/for-vnet-gw" -> (known after apply)
    ~ location                      = "westus2" -> "eastus2" # forces replacement
      name                          = "for-vnet-gw"
    ~ route                         = [
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "local-vnet-to-firewall"
            + next_hop_in_ip_address = "10.0.2.4"
            + next_hop_type          = "VirtualAppliance"
          },
        - {
            - address_prefix         = "10.1.0.0/16"
            - name                   = "local-vnet-to-firewall"
            - next_hop_in_ip_address = "10.0.2.4"
            - next_hop_type          = "VirtualAppliance"
          },
      ]
    ~ subnets                       = [] -> (known after apply)
    - tags                          = {} -> null
      # (2 unchanged attributes hidden)
  }

# module.sites["eastus2"].azurerm_subnet_route_table_association.for_every_subnet_but_vnet_gw[0] will be created
+ resource "azurerm_subnet_route_table_association" "for_every_subnet_but_vnet_gw" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/VmSubnet"
  }

# module.sites["eastus2"].azurerm_subnet_route_table_association.for_vnet_gw[0] will be created
+ resource "azurerm_subnet_route_table_association" "for_vnet_gw" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/GatewaySubnet"
  }

# module.sites["westus2"].azurerm_subnet_route_table_association.for_every_subnet_but_vnet_gw[0] will be created
+ resource "azurerm_subnet_route_table_association" "for_every_subnet_but_vnet_gw" {
    + id             = (known after apply)
    + route_table_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/for-every-subnet-but-vnet-gw"
    + subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/VmSubnet"
  }

# module.sites["westus2"].azurerm_subnet_route_table_association.for_vnet_gw[0] will be created
+ resource "azurerm_subnet_route_table_association" "for_vnet_gw" {
    + id             = (known after apply)
    + route_table_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/for-vnet-gw"
    + subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/GatewaySubnet"
  }

# module.westus2-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "westus2"
    + max_bid_price                   = -1
    + name                            = "westus2-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXfeNESzeBpNFl0W8801NXA+539N6Q06VPKFV63alXC77aoNgNBNU16jDajStBz7zA6brxhwhwTR9V4zQwLJxLkmq2oO8mm1zqy1AgeWC2/zwvp7PJ1Md7vNbmERInJ6FN8C6Xa7jf3NbFQfnaodnb9j+zuFKN4HGi0+Su/EUzvMAqeMS1RjFTxQGhpG0zRdHL9sqnKKR2c9S3/XSWNFej3XFueuMhUnGqyv84vVZYx6SpH383wFIa7Y1p+Skkf3o9WQsQ6pdGvcTIDx6V4+vo5lKUmMOHLiJNx3fGjoDHIDbnhT1GH2Hb8IjFkUKfRqCLr1zKxiWoMxmb/Ipx0FnF jcetina@Jasons-MBP
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.westus2-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "westus2"
    + mac_address                   = (known after apply)
    + name                          = "westus2-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/VmSubnet"
      }
  }

# module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_association" {
    + id                        = (known after apply)
    + network_interface_id      = (known after apply)
    + network_security_group_id = (known after apply)
  }

# module.westus2-vms[0].azurerm_network_security_group.nsg will be created
+ resource "azurerm_network_security_group" "nsg" {
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "westus2-vm-0-nsg"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + security_rule       = [
        + {
            + access                                     = "Allow"
            + description                                = ""
            + destination_address_prefix                 = "*"
            + destination_address_prefixes               = []
            + destination_application_security_group_ids = []
            + destination_port_range                     = "22"
            + destination_port_ranges                    = []
            + direction                                  = "Inbound"
            + name                                       = "SSH"
            + priority                                   = 1001
            + protocol                                   = "Tcp"
            + source_address_prefix                      = "*"
            + source_address_prefixes                    = []
            + source_application_security_group_ids      = []
            + source_port_range                          = "*"
            + source_port_ranges                         = []
          },
      ]
  }

# module.westus2-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "westus2-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.westus2-vms[0].random_id.random_id will be destroyed
# (because random_id.random_id is not in configuration)
- resource "random_id" "random_id" {
    - b64_std     = "Vo7hDbYCxcI=" -> null
    - b64_url     = "Vo7hDbYCxcI" -> null
    - byte_length = 8 -> null
    - dec         = "6237169982959175106" -> null
    - hex         = "568ee10db602c5c2" -> null
    - id          = "Vo7hDbYCxcI" -> null
    - keepers     = {
        - "resource_group" = "org-jcetina-repo-baklava-rg"
      } -> null
  }

Plan: 17 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>